In [1]:
import numpy as np
import pandas as pd

In [2]:
frame1 = pd.DataFrame( {'id':['ball','pencil','pen','mug','ashtray'],
                        'price': [12.33,11.44,33.21,13.23,33.62]})
frame1

        id  price
0     ball  12.33
1   pencil  11.44
2      pen  33.21
3      mug  13.23
4  ashtray  33.62

In [3]:
frame2 = pd.DataFrame( {'id':['pencil','pencil','ball','pen'],
                        'color': ['white','red','red','black']})
frame2

       id  color
0  pencil  white
1  pencil    red
2    ball    red
3     pen  black

In [4]:
pd.merge(frame1,frame2) #This merger where can call as inner join in SQL

       id  price  color
0    ball  12.33    red
1  pencil  11.44  white
2  pencil  11.44    red
3     pen  33.21  black

In [5]:
frame1 = pd.DataFrame( {'id':['ball','pencil','pen','mug','ashtray'],
                        'color': ['white','red','red','black','green'],
                        'brand': ['OMG','ABC','ABC','POD','POD']})
frame1

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [6]:
frame2 = pd.DataFrame( {'id':['pencil','pencil','ball','pen'],
                        'brand': ['OMG','POD','ABC','POD']})
frame2

       id brand
0  pencil   OMG
1  pencil   POD
2    ball   ABC
3     pen   POD

In [7]:
pd.merge(frame1,frame2, on='id') #If you don't use on option, you won't get results because there are two columns with the same name

       id  color brand_x brand_y
0    ball  white     OMG     ABC
1  pencil    red     ABC     OMG
2  pencil    red     ABC     POD
3     pen    red     ABC     POD

In [8]:
pd.merge(frame1,frame2, on='brand')

      id_x  color brand    id_y
0     ball  white   OMG  pencil
1   pencil    red   ABC    ball
2      pen    red   ABC    ball
3      mug  black   POD  pencil
4      mug  black   POD     pen
5  ashtray  green   POD  pencil
6  ashtray  green   POD     pen

In [14]:
frame2.columns=['brand','sid']
frame2

    brand  sid
0  pencil  OMG
1  pencil  POD
2    ball  ABC
3     pen  POD

In [15]:
pd.merge(frame1,frame2,left_on="id",right_on="sid")

Empty DataFrame
Columns: [id, color, brand_x, brand_y, sid]
Index: []

In [17]:
frame2.columns=['brand','id']
frame2

    brand   id
0  pencil  OMG
1  pencil  POD
2    ball  ABC
3     pen  POD

In [18]:
pd.merge(frame1, frame2, on='id')

Empty DataFrame
Columns: [id, color, brand_x, brand_y]
Index: []

In [19]:
pd.merge(frame1, frame2, on='id', how='outer')

        id  color brand_x brand_y
0     ball  white     OMG     NaN
1   pencil    red     ABC     NaN
2      pen    red     ABC     NaN
3      mug  black     POD     NaN
4  ashtray  green     POD     NaN
5      OMG    NaN     NaN  pencil
6      POD    NaN     NaN  pencil
7      POD    NaN     NaN     pen
8      ABC    NaN     NaN    ball

In [20]:
pd.merge(frame1, frame2, on='id', how='left')

        id  color brand_x brand_y
0     ball  white     OMG     NaN
1   pencil    red     ABC     NaN
2      pen    red     ABC     NaN
3      mug  black     POD     NaN
4  ashtray  green     POD     NaN

In [21]:
pd.merge(frame1, frame2, on='id', how='right')

    id color brand_x brand_y
0  OMG   NaN     NaN  pencil
1  POD   NaN     NaN  pencil
2  ABC   NaN     NaN    ball
3  POD   NaN     NaN     pen

In [22]:
pd.merge(frame1, frame2, on=['id','brand'], how='left')

        id  color brand
0     ball  white   OMG
1   pencil    red   ABC
2      pen    red   ABC
3      mug  black   POD
4  ashtray  green   POD

In [23]:
pd.merge(frame1, frame2, on=['id','brand'], how='outer')

        id  color   brand
0     ball  white     OMG
1   pencil    red     ABC
2      pen    red     ABC
3      mug  black     POD
4  ashtray  green     POD
5      OMG    NaN  pencil
6      POD    NaN  pencil
7      ABC    NaN    ball
8      POD    NaN     pen

In [25]:
pd.merge(frame1, frame2, on=['id','brand'], how='right')

    id color   brand
0  OMG   NaN  pencil
1  POD   NaN  pencil
2  ABC   NaN    ball
3  POD   NaN     pen

### Merging on Index

In [26]:
pd.merge(frame1,frame2,right_index=True, left_index=True)

     id_x  color brand_x brand_y id_y
0    ball  white     OMG  pencil  OMG
1  pencil    red     ABC  pencil  POD
2     pen    red     ABC    ball  ABC
3     mug  black     POD     pen  POD

In [27]:
frame1.join(frame2)

ValueError: columns overlap but no suffix specified: Index(['id', 'brand'], dtype='object')

**It will get an error code because some columns of the frame1 have the same name of frame2. Then
rename the columns of frame2 before launching the join( ) function.**

In [28]:
frame2.columns = ['brand2','id2']
frame1.join(frame2)

        id  color brand  brand2  id2
0     ball  white   OMG  pencil  OMG
1   pencil    red   ABC  pencil  POD
2      pen    red   ABC    ball  ABC
3      mug  black   POD     pen  POD
4  ashtray  green   POD     NaN  NaN

**Here you've performed a merging but based on the values of the indexes instead of the columns. This
time there is also the index 4 that was present only in frame1, but the values corresponding to the columns of
frame2 report NaN as value.**

### Concatenating

In [32]:
array1 = [[0, 1, 2],
            [3, 4, 5],
            [6, 7, 8]]
array1

[[0, 1, 2], [3, 4, 5], [6, 7, 8]]

In [34]:
array2 = np.arange(9).reshape((3,3))+6
array2

array([[ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [35]:
np.concatenate([array1,array2],axis=1) #Use axis=1 to join of column become row

array([[ 0,  1,  2,  6,  7,  8],
       [ 3,  4,  5,  9, 10, 11],
       [ 6,  7,  8, 12, 13, 14]])

In [36]:
np.concatenate([array1,array2],axis=0) #Use axis=0 to make concatenate based on column not row

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 6,  7,  8],
       [ 9, 10, 11],
       [12, 13, 14]])

In [37]:
ser1 = pd.Series(np.random.rand(4), index=[1,2,3,4])
ser1

1    0.828336
2    0.533721
3    0.489152
4    0.537442
dtype: float64

In [38]:
ser2 = pd.Series(np.random.rand(4), index=[5,6,7,8])
ser2

5    0.809852
6    0.009275
7    0.642774
8    0.790089
dtype: float64

In [39]:
pd.concat([ser1,ser2])

1    0.828336
2    0.533721
3    0.489152
4    0.537442
5    0.809852
6    0.009275
7    0.642774
8    0.790089
dtype: float64

In [40]:
pd.concat([ser1,ser2],axis=1) #Use axis=1 to change form to be dataframe

          0         1
1  0.828336       NaN
2  0.533721       NaN
3  0.489152       NaN
4  0.537442       NaN
5       NaN  0.809852
6       NaN  0.009275
7       NaN  0.642774
8       NaN  0.790089

In [49]:
pd.concat([ser1,ser2],axis=0)

1    0.828336
2    0.533721
3    0.489152
4    0.537442
5    0.809852
6    0.009275
7    0.642774
8    0.790089
dtype: float64

In [67]:
pd.concat([ser1,ser2],axis=1, join='inner')

Empty DataFrame
Columns: [0, 1]
Index: []

In [46]:
 pd.concat([ser1,ser2], keys=[1,2])

1  1    0.828336
   2    0.533721
   3    0.489152
   4    0.537442
2  5    0.809852
   6    0.009275
   7    0.642774
   8    0.790089
dtype: float64

**To create a hierarchical index on the axis of concatenation. To do this you have to use the
keys option.**

In [47]:
pd.concat([ser1,ser2], axis=1, keys=[1,2])

          1         2
1  0.828336       NaN
2  0.533721       NaN
3  0.489152       NaN
4  0.537442       NaN
5       NaN  0.809852
6       NaN  0.009275
7       NaN  0.642774
8       NaN  0.790089

In [56]:
frame1 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[1,2,3],
columns=['A','B','C'])
frame1

          A         B         C
1  0.540316  0.124845  0.947190
2  0.437509  0.642420  0.395692
3  0.551408  0.688668  0.829006

In [57]:
frame2 = pd.DataFrame(np.random.rand(9).reshape(3,3), index=[4,5,6],
columns=['A','B','C'])
frame2

          A         B         C
4  0.285650  0.372831  0.234984
5  0.899523  0.343955  0.787726
6  0.522432  0.527948  0.630471

In [58]:
pd.concat([frame1, frame2])

          A         B         C
1  0.540316  0.124845  0.947190
2  0.437509  0.642420  0.395692
3  0.551408  0.688668  0.829006
4  0.285650  0.372831  0.234984
5  0.899523  0.343955  0.787726
6  0.522432  0.527948  0.630471

In [59]:
pd.concat([frame1, frame2], axis=1)

          A         B         C         A         B         C
1  0.540316  0.124845  0.947190       NaN       NaN       NaN
2  0.437509  0.642420  0.395692       NaN       NaN       NaN
3  0.551408  0.688668  0.829006       NaN       NaN       NaN
4       NaN       NaN       NaN  0.285650  0.372831  0.234984
5       NaN       NaN       NaN  0.899523  0.343955  0.787726
6       NaN       NaN       NaN  0.522432  0.527948  0.630471

### Combining

There is another situation in which there is combination of data that cannot be obtained either with merging
or with concatenation. Take the case in which you want the two datasets to have indexes that overlap in their
entirety or at least partially.
One applicable function to Series is combine_first(), which performs this kind of operation along with
an data alignment.

In [69]:
ser1 = pd.Series(np.random.rand(5),index=[1,2,3,4,5])
ser1

1    0.881344
2    0.334410
3    0.329496
4    0.593280
5    0.902097
dtype: float64

In [70]:
ser2 = pd.Series(np.random.rand(4),index=[2,4,5,6])
ser2

2    0.134219
4    0.479129
5    0.938826
6    0.362665
dtype: float64

In [71]:
ser1.combine_first(ser2)

1    0.881344
2    0.334410
3    0.329496
4    0.593280
5    0.902097
6    0.362665
dtype: float64

In [73]:
ser2.combine_first(ser1)

1    0.881344
2    0.134219
3    0.329496
4    0.479129
5    0.938826
6    0.362665
dtype: float64

**Instead, if you want a partial overlap, you can specify only the portion of the Series you want to overlap.**

In [74]:
ser1[:3].combine_first(ser2[:3])

1    0.881344
2    0.334410
3    0.329496
4    0.479129
5    0.938826
dtype: float64

## Pivoting

### Pivoting with Hierarchical Indexing

In [76]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
... index=['white','black','red'],
... columns=['ball','pen','pencil'])
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [77]:
frame1.stack()

white  ball      0
       pen       1
       pencil    2
black  ball      3
       pen       4
       pencil    5
red    ball      6
       pen       7
       pencil    8
dtype: int32

In [85]:
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [90]:
frame1.unstack()

ball    white    0
        black    3
        red      6
pen     white    1
        black    4
        red      7
pencil  white    2
        black    5
        red      8
dtype: int32

### Pivoting from Long to Wide Format

In [93]:
longframe = pd.DataFrame({ 'color':['white','white','white',
... 'red','red','red',
... 'black','black','black'],
... 'item':['ball','pen','mug',
... 'ball','pen','mug',
... 'ball','pen','mug'],
... 'value': np.random.rand(9)})
longframe

   color  item     value
0  white  ball  0.817474
1  white   pen  0.711563
2  white   mug  0.393991
3    red  ball  0.951498
4    red   pen  0.703783
5    red   mug  0.126774
6  black  ball  0.355505
7  black   pen  0.038622
8  black   mug  0.580076

**Instead of the long format, there is another way to arrange the data in a table that is called wide. This
mode is easier to read, allowing easy connection with other tables, and it occupies much less space. So in
general it is a more efficient way of storing the data, although less practical, especially if during the filling of
the data.**

In [94]:
wideframe = longframe.pivot('color','item')
wideframe

          value
item       ball       mug       pen
color
black  0.355505  0.580076  0.038622
red    0.951498  0.126774  0.703783
white  0.817474  0.393991  0.711563

**Starting from the previous example you choose to create a DataFrame in wide format by choosing the
color column as the key, and item as a second key, the values of which will form the new columns of the
data frame.**

### Removing

In [96]:
frame1 = pd.DataFrame(np.arange(9).reshape(3,3),
... index=['white','black','red'],
... columns=['ball','pen','pencil'])
frame1

       ball  pen  pencil
white     0    1       2
black     3    4       5
red       6    7       8

In [97]:
del frame1['ball']
frame1

       pen  pencil
white    1       2
black    4       5
red      7       8

In [99]:
frame1.drop('white') #To remove index

       pen  pencil
black    4       5
red      7       8

## Data Transformation

### Removing Duplicates

In [100]:
dframe = pd.DataFrame({ 'color': ['white','white','red','red','white'],
... 'value': [2,1,3,3,2]})
dframe

   color  value
0  white      2
1  white      1
2    red      3
3    red      3
4  white      2

In [101]:
dframe.duplicated()

0    False
1    False
2    False
3     True
4     True
dtype: bool

**The duplicated() function applied to a DataFrame can detect the rows which appear to be
duplicated. It returns a Series of Booleans where each element corresponds to a row, with True if the row
is duplicated (i.e., only the other occurrences, not the first), and with False if there are no duplicates in the
previous elements.**

In [102]:
dframe[dframe.duplicated()] #To know what are the duplicate rows

   color  value
3    red      3
4  white      2

In [104]:
dframe.drop_duplicates()

   color  value
0  white      2
1  white      1
2    red      3

## Mapping

### Replacing Values via Mapping

In [106]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
... 'color':['white','rosso','verde','black','yellow'],
    'price':[5.56,4.20,1.30,0.56,2.75]})
frame

      item   color  price
0     ball   white   5.56
1      mug   rosso   4.20
2      pen   verde   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

Thus to be able to replace the incorrect values in new values is necessary to define a mapping of
correspondences, containing as key to replace the old values and values as the new ones.

In [107]:
newcolors = {
... 'rosso': 'red',
... 'verde': 'green'
... }

In [108]:
frame.replace(newcolors)

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [110]:
ser = pd.Series([1,3,np.nan,4,6,np.nan,3])
ser

0    1.0
1    3.0
2    NaN
3    4.0
4    6.0
5    NaN
6    3.0
dtype: float64

In [112]:
ser.replace(np.nan,0)

0    1.0
1    3.0
2    0.0
3    4.0
4    6.0
5    0.0
6    3.0
dtype: float64

### Adding Values via Mapping

In [114]:
frame = pd.DataFrame({ 'item':['ball','mug','pen','pencil','ashtray'],
... 'color':['white','red','green','black','yellow']})
frame

      item   color
0     ball   white
1      mug     red
2      pen   green
3   pencil   black
4  ashtray  yellow

In [121]:
prices = {
... 'ball' : 5.56,
... 'mug' : 4.20,
... 'bottle' : 1.30,
... 'scissors' : 3.41,
... 'pen' : 1.30,
... 'pencil' : 0.56,
... 'ashtray' : 2.75}

In [123]:
frame['price'] = frame['item'].map(prices)
frame

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

### Rename the Indexes of the Axes

In [124]:
frame

      item   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [125]:
reindex = {
... 0: 'first',
... 1: 'second',
... 2: 'third',
... 3: 'fourth',
... 4: 'fifth'}
frame.rename(reindex)

           item   color  price
first      ball   white   5.56
second      mug     red   4.20
third       pen   green   1.30
fourth   pencil   black   0.56
fifth   ashtray  yellow   2.75

In [128]:
recolumn = {
... 'item':'object',
... 'price': 'value'}
frame.rename(index=reindex, columns=recolumn) #If you do not used reindex it will appear as index at the beginning

         object   color  value
first      ball   white   5.56
second      mug     red   4.20
third       pen   green   1.30
fourth   pencil   black   0.56
fifth   ashtray  yellow   2.75

In [129]:
frame.rename(index={1:'first'}, columns={'item':'object'})

        object   color  price
0         ball   white   5.56
first      mug     red   4.20
2          pen   green   1.30
3       pencil   black   0.56
4      ashtray  yellow   2.75

In [130]:
frame.rename(columns={'item':'object'}, inplace=True)
frame

    object   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

So far you have seen that the **rename()** function returns a DataFrame with the changes, leaving
unchanged the original DataFrame. If you want the changes to take effect on the object on which you call the
function, you will set the **inplace** option to **True**.

In [131]:
frame.rename(columns={'item':'object'}, inplace=True)
frame

    object   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

In [132]:
frame

    object   color  price
0     ball   white   5.56
1      mug     red   4.20
2      pen   green   1.30
3   pencil   black   0.56
4  ashtray  yellow   2.75

## Discretization and Binning

In [133]:
results = [12,34,67,55,28,90,99,12,3,56,74,44,87,23,49,89,87]
bins = [0,25,50,75,100]
cat = pd.cut(results, bins)
cat

[(0, 25], (25, 50], (50, 75], (50, 75], (25, 50], ..., (75, 100], (0, 25], (25, 50], (75, 100], (75, 100]]
Length: 17
Categories (4, interval[int64, right]): [(0, 25] < (25, 50] < (50, 75] < (75, 100]]

In [137]:
pd.value_counts(cat)

(75, 100]    5
(0, 25]      4
(25, 50]     4
(50, 75]     4
dtype: int64

Finally to know the occurrences for each bin, that is, how many results fall into each category, you have
to use the **value_counts()** function.

In [138]:
bin_names = ['unlikely','less likely','likely','highly likely']

In [139]:
pd.cut(results, bins, labels=bin_names)

['unlikely', 'less likely', 'likely', 'likely', 'less likely', ..., 'highly likely', 'unlikely', 'less likely', 'highly likely', 'highly likely']
Length: 17
Categories (4, object): ['unlikely' < 'less likely' < 'likely' < 'highly likely']

If the **cut()** function is passed as an argument to an integer instead of explicating the bin edges, this will
divide the range of values of the array in many intervals as specified by the number.

The limits of the interval will be taken by the minimum and maximum of the sample data, namely, the
array subjected to binning.

In [140]:
pd.cut(results, 5)

[(2.904, 22.2], (22.2, 41.4], (60.6, 79.8], (41.4, 60.6], (22.2, 41.4], ..., (79.8, 99.0], (22.2, 41.4], (41.4, 60.6], (79.8, 99.0], (79.8, 99.0]]
Length: 17
Categories (5, interval[float64, right]): [(2.904, 22.2] < (22.2, 41.4] < (41.4, 60.6] < (60.6, 79.8] < (79.8, 99.0]]

In addition to **cut()**, pandas provides another method for binning: **qcut().** This function divides the
sample directly into quintiles. In fact, depending on the distribution of the data sample, using **cut()** rightly
you will have a different number of occurrences for each bin. Instead **qcut()** will ensure that the number of
occurrences for each bin is equal, but the edges of each bin to vary.

In [141]:
quintiles = pd.qcut(results, 5)
quintiles

[(2.999, 24.0], (24.0, 46.0], (62.6, 87.0], (46.0, 62.6], (24.0, 46.0], ..., (62.6, 87.0], (2.999, 24.0], (46.0, 62.6], (87.0, 99.0], (62.6, 87.0]]
Length: 17
Categories (5, interval[float64, right]): [(2.999, 24.0] < (24.0, 46.0] < (46.0, 62.6] < (62.6, 87.0] < (87.0, 99.0]]

In [142]:
pd.value_counts(quintiles)

(2.999, 24.0]    4
(62.6, 87.0]     4
(24.0, 46.0]     3
(46.0, 62.6]     3
(87.0, 99.0]     3
dtype: int64

As you can see, in the case of quintiles, the intervals bounding the bin differ from those generated by the
**cut()** function. Moreover, if you look at the occurrences for each bin will find that **qcut()** tried to standardize
the occurrences for each bin, but in the case of quintiles, the first two bins have an occurrence in more
because the number of results is not divisible by five

### Detecting and Filtering Outliers

In [144]:
randframe = pd.DataFrame(np.random.randn(1000,3))
randframe

            0         1         2
0   -0.709241 -0.381706 -0.313239
1   -0.050905  0.247951  1.545820
2    0.481102 -0.702874  0.041177
3    2.771643 -0.835675 -1.219766
4    1.879699 -0.328082  0.754701
..        ...       ...       ...
995 -0.920648 -0.214848 -1.818121
996 -2.130094 -1.755218  0.090429
997 -0.148574 -1.026556  1.575299
998 -0.372771  0.130949  0.219417
999 -1.040968 -1.507559  0.545147

[1000 rows x 3 columns]

In [147]:
randframe.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean     -0.004687    -0.031142    -0.008074
std       0.966869     1.010001     0.994597
min      -3.150650    -2.965491    -3.102069
25%      -0.660279    -0.714404    -0.680171
50%       0.003739    -0.047865     0.022807
75%       0.587773     0.635800     0.668847
max       3.223109     3.431283     3.276589

In [146]:
randframe.std()

0    0.966869
1    1.010001
2    0.994597
dtype: float64

In [148]:
randframe[(np.abs(randframe) > (3*randframe.std())).any(1)] #The function any() to apply the filter on each column.

            0         1         2
66   0.455642  0.152428  3.276589
134  3.223109  1.792281  0.018475
232  1.223993 -1.042330 -3.102069
316 -3.150650  1.236919  0.046223
639  0.279939  3.431283 -0.150805
688  3.005973 -0.246151  0.237246
799  0.103669 -0.167673  3.102465
956 -2.939533  0.824279 -0.002978

### Permutation

In [6]:
nframe = pd.DataFrame(np.arange(25).reshape(5,5))
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [10]:
new_order = np.random.permutation(5) #This will be the new order in which to set the values of a row of DataFrame
new_order

array([0, 2, 4, 3, 1])

In [11]:
nframe.take(new_order)
nframe

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [12]:
new_order = [3,4,2]

In [13]:
nframe.take(new_order)

    0   1   2   3   4
3  15  16  17  18  19
4  20  21  22  23  24
2  10  11  12  13  14

You can submit even a portion of the entire DataFrame to a permutation. It generates an array that has a
sequence limited to a certain range

### Random Sampling

Sometimes, when you have a huge DataFrame, you may have the need to sample it randomly, and the
quickest way to do this is by using the **np.random.randint()** function.

In [14]:
sample = np.random.randint(0, len(nframe), size=3)
sample

array([1, 1, 4])

In [15]:
nframe.take(sample)

    0   1   2   3   4
1   5   6   7   8   9
1   5   6   7   8   9
4  20  21  22  23  24

## String Manipulation

### Built-in Methods for Manipulation of Strings

In many cases you have composite strings in which you would like to separate the various parts and then
assign them to the correct variables. The **split()** function allows us to separate parts of a text, taking as a
reference point a separator, for example a comma.

In [18]:
text = '16 Bolton Avenue , Boston'
text

'16 Bolton Avenue , Boston'

In [19]:
text.split(',')

['16 Bolton Avenue ', ' Boston']

As we can see in the first element, you have a string with a space character at the end. To overcome this
problem and often a frequent problem, you have to use the **split()** function along with the **strip()** function
that takes care of doing the trim of whitespace (including newlines)

In [20]:
tokens = [s.strip() for s in text.split(',')]
tokens

['16 Bolton Avenue', 'Boston']

In [21]:
address, city = [s.strip() for s in text.split(',')]
address

'16 Bolton Avenue'

In [22]:
city

'Boston'

In [24]:
address

'16 Bolton Avenue'

In [25]:
address+','+city

'16 Bolton Avenue,Boston'

The most intuitive and simple way is to concatenate the various parts of the text with the operator '+'.

In [26]:
strings = ['A+','A','A-','B','BB','BBB','C+']
';'.join(strings)

'A+;A;A-;B;BB;BBB;C+'

If the parts to be
concatenated are much more, a more practical approach in this case will be to use the **join()** function
assigned to the separator character, with which you want to join the various strings between them.

In [27]:
'boston' in text

False

In [28]:
'Boston' in text

True

In [30]:
text.index('Boston')

19

In [32]:
text.find('Boston')

19

In [33]:
text.index('New York')

ValueError: substring not found

In [34]:
text.find('New York')

-1

The difference in the behavior of these two functions can be seen, however, when the substring is
not found.

In [35]:
text.count('e') #To know how many times a character or combination of characters (substring) occurs within a text

2

In [37]:
text.count('Avenue')

1

Another operation that can be performed on strings is the replacement or elimination of a substring
(or a single character). In both cases you will use the **replace()** function, where if you are prompted
to replace a substring with a blank character, the operation will be equivalent to the elimination of the
substring from the text.

In [38]:
text.replace('Avenue','Street')

'16 Bolton Street , Boston'

In [39]:
text.replace('1','')

'6 Bolton Avenue , Boston'

### Regular Expressions

The regular expressions provide a very flexible way to search and match string patterns within a text. A single
expression, generically called **regex**, is a string formed according to the regular expression language. There
is a built-in Python module called **re**, which is responsible for the operation of the regex.

In [2]:
import re

In [42]:
text = "This is an\t odd \n text!"
re.split('\s+', text)

['This', 'is', 'an', 'odd', 'text!']

But analyze more deeply the mechanism of re module. When you call the **re.split()** function, the
regular expression is first compiled, then subsequently calls the **split()** function on the text argument. You
can compile the regex function with the **re.compile()** function, thus obtaining a reusable object regex and
so gaining in terms of CPU cycles

In [43]:
regex = re.compile('\s+')

So if you make an regex object with the **compile()** function, you can apply **split()** directly to it in the
following way.

In [44]:
regex.split(text)

['This', 'is', 'an', 'odd', 'text!']

As regards matching a regex pattern with any other business substrings in the text, you can use the
**findall()** function. It returns a list of all the substrings in the text that meet the requirements of the regex.

In [45]:
text = 'This is my address: 16 Bolton Avenue, Boston'
re.findall('A\w+',text)

['Avenue']

In [46]:
re.findall('[A,a]\w+',text)

['address', 'Avenue']

There are two other functions related to the function **findall()**: **match()** and **search()**. While **findall()**
returns all matches within a list, the function **search()** returns only the first match.

In [47]:
re.search('[A,a]\w+',text)

This object does not contain the value of the substring that responds to the regex pattern, but its start
and end positions within the string.

In [48]:
search = re.search('[A,a]\w+',text)
search.start()

11

In [49]:
search.end()

18

In [50]:
text[search.start():search.end()]

'address'

The **match()** function performs the matching only at the beginning of the string; if there is no match
with the first character, it goes no further in research within the string. If you do not find any match then it
will not return any objects.

In [53]:
re.match('[A,a]\w+',text)

If **match()** has a response, then it returns an object identical to what you saw for the **search()** function.

In [54]:
re.match('T\w+',text)

In [55]:
match = re.match('T\w+',text)

In [56]:
text[match.start():match.end()]

'This'

In [58]:
match.start()

0

In [59]:
match.end()

4

## Data Aggregation

### GroupBy

In [14]:
frame = pd.DataFrame({ 'color': ['white','red','green','red','green'],
... 'object': ['pen','pencil','pencil','ashtray','pen'],
... 'price1' : [5.56,4.20,1.30,0.56,2.75],
... 'price2' : [4.75,4.12,1.60,0.75,3.15]})
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

In [4]:
group = frame['price1'].groupby(frame['color'])
group

The object that we got is a **GroupBy** object. In the operation that you just did there was not really any
calculation; there was just a collection of all the information needed to calculate to be executed. What you
have done is in fact a process of grouping, in which all rows having the same value of color are grouped into
a single item

In [5]:
group.groups #To analyze in detail how the division into groups of rows of DataFrame was made

{'green': [2, 4], 'red': [1, 3], 'white': [0]}

In [6]:
group.mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [7]:
group.sum()

color
green    4.05
red      4.76
white    5.56
Name: price1, dtype: float64

### Hierarchical Grouping

In [8]:
ggroup = frame['price1'].groupby([frame['color'],frame['object']])
ggroup.groups

{('green', 'pen'): [4], ('green', 'pencil'): [2], ('red', 'ashtray'): [3], ('red', 'pencil'): [1], ('white', 'pen'): [0]}

In [9]:
ggroup.sum()

color  object
green  pen        2.75
       pencil     1.30
red    ashtray    0.56
       pencil     4.20
white  pen        5.56
Name: price1, dtype: float64

So far you have applied the grouping to a single column of data, but in reality it can be extended to
multiple columns or the entire data frame. Also if you do not need to reuse the object GroupBy several
times, it is convenient to combine in a single passing all of the grouping and calculation to be done, without
defining any intermediate variable

In [10]:
frame[['price1','price2']].groupby(frame['color']).mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

In [11]:
frame.groupby(frame['color']).mean()

       price1  price2
color
green   2.025   2.375
red     2.380   2.435
white   5.560   4.750

## Group Iteration

The **GroupBy** object supports the operation of an iteration for generating a sequence of 2-tuples containing
the name of the group together with the data portion.

In [15]:
frame = pd.DataFrame({ 'color': ['white','red','green','red','green'],
... 'object': ['pen','pencil','pencil','ashtray','pen'],
... 'price1' : [5.56,4.20,1.30,0.56,2.75],
... 'price2' : [4.75,4.12,1.60,0.75,3.15]})
frame

   color   object  price1  price2
0  white      pen    5.56    4.75
1    red   pencil    4.20    4.12
2  green   pencil    1.30    1.60
3    red  ashtray    0.56    0.75
4  green      pen    2.75    3.15

In [25]:
for name, group in frame.groupby('color'):
    print (name)
    print (group)

green
   color  object  price1  price2
2  green  pencil    1.30    1.60
4  green     pen    2.75    3.15
red
  color   object  price1  price2
1   red   pencil    4.20    4.12
3   red  ashtray    0.56    0.75
white
   color object  price1  price2
0  white    pen    5.56    4.75

### Chain of Transformations

In [26]:
result1 = frame['price1'].groupby(frame['color']).mean()
type(result1)

pandas.core.series.Series

In [27]:
result2 = frame.groupby(frame['color']).mean()
type(result2)

pandas.core.frame.DataFrame

So it is possible to select a single column at any point in the various phases of this process. Here are
three cases in which the selection of a single column in three different stages of the process applies. This
example illustrates the great flexibility of this system of grouping provided by pandas

In [28]:
frame['price1'].groupby(frame['color']).mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [29]:
frame.groupby(frame['color'])['price1'].mean()

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In [30]:
(frame.groupby(frame['color']).mean())['price1']

color
green    2.025
red      2.380
white    5.560
Name: price1, dtype: float64

In addition, after an operation of aggregation the names of some columns may not be very meaningful
in certain cases. In fact it is often useful to add a prefix to the column name that describes the type of
business combination. Adding a prefix, instead of completely replacing the name, is very useful for keeping
track of the source data from which they are derived aggregate values. This is important if you apply a
process of transformation chain (a series of data frame is generated from each other) in which it is important
to somehow keep some reference with the source data.

In [31]:
means = frame.groupby('color').mean().add_prefix('mean_') #To describes the type of business combination.
means

       mean_price1  mean_price2
color
green        2.025        2.375
red          2.380        2.435
white        5.560        4.750

### Functions on Groups

In [32]:
group = frame.groupby('color')
group['price1'].quantile(0.6)

color
green    2.170
red      2.744
white    5.560
Name: price1, dtype: float64

You can also define their own aggregation functions. Define the function separately and then you
pass as an argument to the **mark()** function. For example, you could calculate the range of the values of
each group.

In [35]:
def range(series):
    return series.max() - series.min()

group['price1'].agg(range)

color
green    1.45
red      3.64
white    0.00
Name: price1, dtype: float64

The **agg()** function allows you to use aggregate functions on an entire DataFrame.

In [36]:
group.agg(range)

C:\Users\Anggi Firdian Saputr\AppData\Local\Temp\ipykernel_116372\2919840691.py:1: FutureWarning: ['object'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  group.agg(range)

       price1  price2
color
green    1.45    1.55
red      3.64    3.37
white    0.00    0.00

Also you can use more aggregate functions at the same time always with the **mark()** function passing an
array containing the list of operations to be done, which will become the new columns.

In [37]:
group['price1'].agg(['mean','std',range])

        mean       std  range
color
green  2.025  1.025305   1.45
red    2.380  2.573869   3.64
white  5.560       NaN   0.00

## Advanced Data Aggregation

In this section you will be introduced to **transform()** and **apply()** functions, which will allow you to perform
many kinds of group operations, some very complex.
Now suppose we want to bring together in the same DataFrame the following: **(i) the DataFrame of
origin (the one containing the data)** and **(ii) that obtained by the calculation of group aggregation, for
example, the sum.**

In [39]:
frame = pd.DataFrame({ 'color':['white','red','green','red','green'],
... 'price1':[5.56,4.20,1.30,0.56,2.75],
... 'price2':[4.75,4.12,1.60,0.75,3.15]})
frame

   color  price1  price2
0  white    5.56    4.75
1    red    4.20    4.12
2  green    1.30    1.60
3    red    0.56    0.75
4  green    2.75    3.15

In [40]:
sums = frame.groupby('color').sum().add_prefix('tot_')
sums

       tot_price1  tot_price2
color
green        4.05        4.75
red          4.76        4.87
white        5.56        4.75

In [42]:
pd.merge(frame,sums,left_on='color',right_index=True)

   color  price1  price2  tot_price1  tot_price2
0  white    5.56    4.75        5.56        4.75
1    red    4.20    4.12        4.76        4.87
3    red    0.56    0.75        4.76        4.87
2  green    1.30    1.60        4.05        4.75
4  green    2.75    3.15        4.05        4.75

But actually there is another way to do this type of operation. That is by using the
**transform()**. This function performs the calculation of aggregation as you have seen before, but at the same
time shows the values calculated based on the key value on each line of the data frame to start

In [43]:
frame.groupby('color').transform(np.sum).add_prefix('tot_')

   tot_price1  tot_price2
0        5.56        4.75
1        4.76        4.87
2        4.05        4.75
3        4.76        4.87
4        4.05        4.75

The method to cover more general GroupBy is applicable to **apply()**. This method applies in its
entirety the scheme split-apply-combine. In fact, this function divides the object into parts in order
to be manipulated, invokes the passage of function on each piece, and then tries to chain together the
various parts

In [45]:
frame = pd.DataFrame( { 'color':['white','black','white','white','black','black'],
... 'status':['up','up','down','down','down','up'],
... 'value1':[12.33,14.55,22.34,27.84,23.40,18.33],
... 'value2':[11.23,31.80,29.99,31.18,18.25,22.44]})
frame

   color status  value1  value2
0  white     up   12.33   11.23
1  black     up   14.55   31.80
2  white   down   22.34   29.99
3  white   down   27.84   31.18
4  black   down   23.40   18.25
5  black     up   18.33   22.44

In [46]:
frame.groupby(['color','status']).apply( lambda x: x.max())

              color status  value1  value2
color status
black down    black   down   23.40   18.25
      up      black     up   18.33   31.80
white down    white   down   27.84   31.18
      up      white     up   12.33   11.23

In [49]:
reindex = {
... 0: 'first',
... 1: 'second',
... 2: 'third',
... 3: 'fourth',
... 4: 'fifth'}
frame.rename(reindex)

        color status  value1  value2
first   white     up   12.33   11.23
second  black     up   14.55   31.80
third   white   down   22.34   29.99
fourth  white   down   27.84   31.18
fifth   black   down   23.40   18.25
5       black     up   18.33   22.44

In [50]:
recolumn = {
... 'item':'object',
... 'price': 'value'}
frame.rename(index=reindex, columns=recolumn) #If you do not used reindex it will appear as index at the beginning

        color status  value1  value2
first   white     up   12.33   11.23
second  black     up   14.55   31.80
third   white   down   22.34   29.99
fourth  white   down   27.84   31.18
fifth   black   down   23.40   18.25
5       black     up   18.33   22.44

In [51]:
frame.rename(index=reindex, columns=recolumn)

        color status  value1  value2
first   white     up   12.33   11.23
second  black     up   14.55   31.80
third   white   down   22.34   29.99
fourth  white   down   27.84   31.18
fifth   black   down   23.40   18.25
5       black     up   18.33   22.44

In [53]:
temp = pd.date_range('1/1/2015', periods=10, freq='H')
temp

DatetimeIndex(['2015-01-01 00:00:00', '2015-01-01 01:00:00',
               '2015-01-01 02:00:00', '2015-01-01 03:00:00',
               '2015-01-01 04:00:00', '2015-01-01 05:00:00',
               '2015-01-01 06:00:00', '2015-01-01 07:00:00',
               '2015-01-01 08:00:00', '2015-01-01 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [55]:
timetable = pd.DataFrame( {'date': temp, 'value1' : np.random.rand(10),
... 'value2' : np.random.rand(10)})
timetable

                 date    value1    value2
0 2015-01-01 00:00:00  0.171826  0.457874
1 2015-01-01 01:00:00  0.627258  0.063638
2 2015-01-01 02:00:00  0.440989  0.519656
3 2015-01-01 03:00:00  0.837263  0.450297
4 2015-01-01 04:00:00  0.003219  0.455411
5 2015-01-01 05:00:00  0.599502  0.764539
6 2015-01-01 06:00:00  0.858896  0.787492
7 2015-01-01 07:00:00  0.808228  0.191847
8 2015-01-01 08:00:00  0.349641  0.478476
9 2015-01-01 09:00:00  0.026433  0.637684

We add to the DataFrame preceding a column that represents a set of text values that we will use as
key values.

In [56]:
timetable['cat'] = ['up','down','left','left','up','up','down','right','right','up']
timetable

                 date    value1    value2    cat
0 2015-01-01 00:00:00  0.171826  0.457874     up
1 2015-01-01 01:00:00  0.627258  0.063638   down
2 2015-01-01 02:00:00  0.440989  0.519656   left
3 2015-01-01 03:00:00  0.837263  0.450297   left
4 2015-01-01 04:00:00  0.003219  0.455411     up
5 2015-01-01 05:00:00  0.599502  0.764539     up
6 2015-01-01 06:00:00  0.858896  0.787492   down
7 2015-01-01 07:00:00  0.808228  0.191847  right
8 2015-01-01 08:00:00  0.349641  0.478476  right
9 2015-01-01 09:00:00  0.026433  0.637684     up